# Taps
tap "adoptopenjdk/openjdk"
tap "git-time-metric/gtm"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shopify/shopify"
tap "stripe/stripe-cli"

# Software
# brew "cscope"
# brew "emacs"
# brew "ledger"
# brew "macvim"
# brew "node"
# brew "nodenv"
brew "ansible"
brew "autoconf"
brew "automake"
brew "autossh"
brew "bash"
brew "bat"
brew "cask"
brew "cmake"
brew "composer"
brew "ctags"
brew "curl"
brew "dnsmasq", restart_service: true
brew "doctl"
brew "eigen"
brew "elixir"
brew "espeak"
brew "ffmpeg"
brew "flyway"
brew "freetds"
brew "gcc"
brew "gdb"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "grep"
brew "go"
brew "gpg"
brew "graphviz"
brew "gtm"
brew "heroku/brew/heroku"
brew "htop"
brew "ilmbase"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "libmemcached"
brew "libtool"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "luajit"
brew "lynx"
brew "man2html"
brew "mcrypt"
brew "msgpack"
brew "mysql", restart_service: true
brew "nasm"
brew "neovim"
brew "nginx", restart_service: true
brew "nmap"
brew "oniguruma"
brew "openexr"
brew "optipng"
brew "pandoc"
brew "pass"
brew "pgcli"
brew "pgloader"
brew "php"
brew "poppler"
brew "postgis"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "r"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-build"
brew "s3cmd"
brew "shellcheck"
brew "shopify/shopify/themekit"
brew "sqlite"
brew "sshfs"
brew "stripe/stripe-cli/stripe"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "vips"
brew "watchman"
brew "wget"
brew "xz"
brew "yarn"
brew "zsh"

# Casks
cask "syncthing"
cask "adoptopenjdk"
cask "adoptopenjdk8"
cask "alacritty"
cask "graphiql"
cask "iterm2"
cask "keepassx"
cask "nextcloud"
cask "osxfuse"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "vlc"
cask "zterm"
cask "mactex"
