# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "osrf/simulation"
tap "git-time-metric/gtm"

# Software
# cask "java"
cask "xquartz"
brew "libyaml"
brew "ansible"
brew "docbook"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "emacs"
brew "cask"
brew "composer"
brew "cscope"
brew "ctags"
brew "curl"
brew "dnsmasq", restart_service: true
brew "doctl"
brew "eigen"
brew "elixir"
brew "espeak"
brew "freetds"
brew "isl"
brew "mpfr"
brew "gcc"
brew "gdb"
brew "git"
brew "glassfish"
brew "gradle"
brew "ilmbase"
brew "libtool"
brew "xz"
brew "imagemagick"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "libmemcached"
brew "lynx"
brew "macvim"
brew "man2html"
brew "maven"
brew "mcrypt"
brew "mysql", restart_service: true
brew "nasm"
brew "neovim"
brew "nginx", restart_service: true
brew "nmap"
brew "node"
brew "numpy"
brew "openexr"
brew "pgcli"
# brew "php@7.1", restart_service: true
brew "pinentry"
brew "poppler"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "s3cmd"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "watchman"
brew "wget"
brew "heroku/brew/heroku"
brew "osrf/simulation/gazebo8"
brew "pgloader"
brew "mupdf"
brew "pandoc"
brew "optipng"
brew "gtm"
brew "graphviz"
brew "lastpass"
brew "shellcheck"

# Casks
cask "cura"
cask "graphiql"
# cask "java7"
cask "keepassx"
cask "osxfuse"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "vlc"
cask "zterm"
cask "syncthing-app"

